[ItemDefs.ID_TaggartFist:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="His smell was so strong that he raised his head towards his face.. The word "mother" is written on her knee.."
